a base di
abracadabra
accijns
actitud
a causa di
abraso
accion
activa
a costo di
abrenuncia
accionista
activamente
a la parrilla
abrevia
accolade
activando
a lo largo
abreviacion
accountant
actividad
a pesar cu
abreviando
accounting
activismo
a pesar di
abruptamente
acelera
activista
a traves di
abrupto
aceleracion
activo
aambei
absentismo
acelerando
acto
aangifte
absolucion
acepta
actoactoprima
aanmaning
absolutamente
aceptabel
actoactoprimo
aanslag
absolutismo
aceptabilidad
actoprima
aardappel [ardaplo]
absoluto
aceptacion
actoprimo
abandono
absolve
aceptamento
actor
abao/abou
absolvi
aceptando
actriz
abarca
absolviendo
acera
actua
abastece
absorba [absorbe]
acerca
actuacion
abastecemento
absorbacion
acercamento
actual
abasteci
absorbamento
acercando
actualidad
abasteciendo
absorbando
acesorio
actualisa
abattoir
absorbe [absorba]
acetona
actualisacion
abces
abstencion
acido
actualisando
abdica
abstene
aclara
actualmente
abdicacion
absteniendo
aclarabel
actuamento
abdicamento
abstinencia
aclaracion
actuando
abdicando
abstinente
aclarando
acuaducto
abdomen
abstraccion
aclarativo
Acuario
abdominal
abstracto
aclaratorio
acuatico
abeha
abstrae
aclaria
acudi
abierta (carta -)
abstrai
aclimatisa
acudiendo
abiertamente
abstrayendo
aclimatisacion
acuerdo
abierto
absurdidad
aclimatisando
acultura
abismo
absurdo
acoge
aculturacion
ablif
abundancia
acogida
aculturando
abnormal
abundante
acogiendo
acumula
abnormalidad
abusa
acomoda
acumulacion
abo
abusado
acomodacion
acumulando
abogacia
abusando
acomodando
acumulativo
abogado
abuso
acompaña
acupunctura
aboli
acaba
acompañamento
acupuncturista
abolicion
acabado
acompañando
acusa
aboliendo
acabando
acompañante
acusacion
abominabel
academia
acontecimento
acusado
abona
academico
acopla
acusando
abonado
acaso
acoplacion
acusativo
abonando
accent
acoplamento
acustica
abono
accento (enfoke)
acoplando
acustico
aborda
accentua
acorda
adagio (mus.)
abordamento
accentuacion
acordando
adapta
abordando
accentuando
acordeon
adaptabel
abordo
accesibel
acordeonista
adaptacion
aborigen
accesibilidad
acredita
adaptamento
aborta
acceso
acreditando
adaptando
abortando
accident [accidente]
acreditivo
adapter
aborto [abortus]
accidenta
acrobaat
adecua [adecuado]
abortus [aborto]
accidental
acrobatico
adecuadamente
aboso
accidentalmente
acrostico
adecuado [adecua]
abou/abao
accidente [accident]
acta
adelanta
adelantando
adrenalina
africanista
aguardiente
adelante
adres
Africano
agudo
adelanto
adresa
africor
aguila
ademas
adresamento
afro
aguinaldo
aden
adresando
Afroantiano
aha
ader
aduana [duana]
Afrobrasileño
aheno
adherente
adulterio
[Afrobrasilero]
ahichi
adheri
adulto
Afrobrasilero
ahusta
adheriendo
advent
[Afrobrasileño]
ahustabel
adhesion
adventismo
Afrocaribense
ahustacion
adhetiva
adventista
[Afrocaribeño]
ahustando
adhetival
adverbial
Afrocaribeño
AIDS
adhetivo
adverbio
[Afrocaribense]
ainda
adhunto
adversario
Afrocubano
aira [aire]
adiccion
advertencia
Afromericano
airco
adicion
adverti
afspraak
aircondition
adicional
advertiendo
aftershave
aire [aira]
adictivo
aereo
afzender
aisla
adicto
aerobic
agata
aislamento
adjust
aerodinamica
agencia
aislando
adkiri
aerodinamico
agenda
aki
adkiribel
aerolinea [linea aereo]
agente
akibanda
adkiriendo
aeronauta
agita
akibao/akibou
adkisicion
aeronautica
agitacion
akibou/akibao
administra
aeronautico
agitado
akicerca
administracion
aeronave
agitamento
akiden
administrado
aeroplano
agitando
akifo
administramento
aeropuerto
aglomera
akiriba
administrando
af
aglomeracion
akitras
administrativo
afan
aglomerando
alaba
admira
afdak
agogia
alabando
admiraal
afeccion
agogo
alabansa/alabanza
admirabel
afecta
agonia
alabanza/alabansa
admiracion
afectando
agota
alabaster
admirado [admirador]
afectivo
agotacion
alabes
admirador [admirado]
aferesis
agrada
alablanca
admiradora
affaire
agradabel
alafan (alafin -)
admirando
afgekeurd
agradecido
alafin
admisibel
afiho
agrado
alameda
admision
afilia
agrario
alarma
admiti
afiliacion
agrega
alarmando
admitibel
afiliado
agregacion
alarmante
admitiendo
afiliando
agregamento
Albanes
adolescencia
afirma
agregando
Albania
adolescente
afirmacion
agresion
albatros
adopcion
afirmando
agresivamente
albinismo
adopta
afirmativamente
agresividad
albino
adoptacion
afirmativo
agresivo
album
adoptamento
afliccion
agresor
alcance
adoptando
afligi
agricola
alcansa
adoptante
afloop
agricultor
alcansabel
adoptivo
afo
agricultura
alcansabilidad
adora
afortunadamente
agronomia
alcansando
adorabel
Africa
agronomista
alcapara
adoracion
africanisa
agrupa
alcohol
adorado
africanisacion
agrupacion
alcoholico
adorando
africanisando
agrupando
alcoholisa
adorno
africanismo
agterstef
alcoholisacion
alcoholisando
alivio
amateurismo
amperahe
alcoholismo
alkimia
amazona
ampère
alcoholista
alkimista
Amazona (riu)
amplia
alegoria
all risk
Amazonia
ampliacion
alegorico
Allah
Amazonico
ampliamente
alegra
allegro (mus.)
ambicion
ampliamento
alegrando
alma
ambiciona
ampliando
alegre
almanak
ambicionando
amplifier
alegria [legria]
almasola
ambicioso
amplio
aleha
almendra
ambiental
amputa
alehamento
aloca
ambientalista
amputacion
alehando
alocacion
ambiente
amputamento
alein [aluin]
alocando
ambivalencia
amputando
aleli (mata)
aloe
ambivalente
amsoi
aleluya
alofon
Ambon
amulet
Aleman
aloha
Ambones
anabolico
Alemania
alohamento
ambos
anabolismo
alergia
alohando
ambtenaar
anaconda
alergico
alomorf
ambulance
anacronico
alerta
alpinismo
ambulante
anacronismo
alertando
alpinista
ambulatorio
anagram
aletria
alrededor
amen
anal
aleu
altamente
amenamente
analfabetico
alfabet
altar
ameno
analfabetismo
alfabeticamente
altera
America
analfabeto
alfabetico
alteracion
America Latino
analisa
alfabetisa
alterando
americanisa
analisando
alfabetisacion
alternativa
americanisacion
analisis
alfabetisamento
alternativo
americanisando
analista
alfabetisando
alternator
americanismo
analiticamente
alfabetismo
altesa/alteza
americanista
analitico
alga
alteza/altesa
Americano
analogia
algebra
altisimo
amfetamina
analogicamente
algebraico
altocomisario
amfitheater [anfiteatro]
analogico
Algeria
altoinspector
amethist
analogo
Algeriano
altruismo
ami
anarkia
algo
altruista
amical
anarkico
algun
altura (na -)
amicalmente
anarkismo
alia
aludi
amiga
anarkista
aliado
aluin [alein]
amigo
anasa
aliando
aluminio [aluminium]
amiguita
anatomia
aliansa/alianza
aluminium [aluminio]
amiguito
anatomico
alianza/aliansa
alumna
amistad
anatomista
alias
alumno
amistosamente
anchoks
aliento
alusion
amistoso
anchovis
alimenta
alveolar
amnesia
anciana
alimentacion
ama di cas
amnistia
anciano
alimentando
amabel
amoebe
anda
alimenticio
amabilidad
amonestacion
andando
alimento
amachi
amoniak
andansa
alinea (s.)
amandel
amor
andante (mus.)
alinia (v.)
amante
amoral
Andes
aliniacion
amarga
amoralidad
andijvie
aliniando
amargamente
amorf
Andino
alitera
amargando
amoroso
andragogia
aliteracion
amargo
amortisa
andragogico
alivia
amargura
amortisacion
andragogo
aliviando
amateur
amortisando
andun
anecdota
antemano
antohando
aplasa
anecdotico
antena
antoho
aplasando
anemia
antepasado
antologia
aplasta
anemico
antepenultimo
antonimia
aplastando
anestesia
anterior
antonimo
aplastante
anestesista
anteriormente
antropologia
aplaudi
anexa
antes
antropologicamente
aplaudiendo
anexando
antesala
antropologico
aplauso
anexion
anti
antropologo
aplica
anexo
Antia [Antias]
antroposofia
aplicabel
anfiteatro [amfitheater]
Antia Hulandes
antroposofico
aplicabilidad
anfitrion
[Antias Hulandes]
antroposofo
aplicacion
angel
antiaereo
anturium
aplicado
angelica
antialcohol
anual
aplicando
angelical
Antiano
anualmente
aplo [appel]
angina
Antias [Antia]
anula
apocalipsis
anglicano
Antias Hulandes
anulacion
apocaliptico
anglicismo
[Antia Hulandes]
anulando
apocope
Angola
antibiotica
anuncia
apolitico
Angoles
antibiotico
Anunciacion
apolitismo
angulo
anticipa
anunciado
apologia
angustia
anticipacion
anunciando
aporta
anhela
anticipando
anuncio
aportacion
anhelando
anticlerical
aña
aportando
anhelo
anticlimax
añadi
aposicion
anima
anticolonialismo
añadiendo
apostel
animacion
anticolonialista
apachi
apostolado
animado
anticonceptivo
aparato
apostolico
animal
anticonstitucional
aparece
apostrof
animando
anticua
apareci
apoya
animo
anticuariado
apareciendo
apoyado
anis
anticurpa
aparencia [apariencia]
apoyando
anisat
antidemocratico
aparenta
apoyo
aniversario
antiek
aparentemente
appel [aplo]
anker [hancro]
antifaz
aparicion
appelmoes
anochi
antiguedad
apariencia [aparencia]
appendicitis
anomalia
antiguo
apart
appendix
anonimidad
antiheroe
aparta
aprecia
anonimo
antihigienico
apartamento
apreciabel
anorganico
antiloop
apartando
apreciando
anos
antimilitarismo
aparte
aprecio
anota
antimilitarista
apartheid
aprendis
anotacion
antinatural
apasibel
april
anotando
antioxidante
apasiona
aproba
ansha
antipatia
apasionante
aprobacion
anshamento
antipaticamente
apatia
aprobando
anshando
antipatico
apatico
apropia
ansiedad
antirevolucionario
apela
apropiacion
ansiosamente
antisemita
apelacion
apropiadamente
ansioso
antisemitico
apelando
aproxima
antagonismo
antisemitismo
apelativo
aproximacion
antagonista
antiseptico
apeldam
aproximadamente
antaño
antislip
apelsina
aproximando
Antartica
antisocial
apenas
apuro
Antartico
antitesis
apendectomia
aqua
antayera
antiwa
aperitivo
aquacultura
antecedente
anto
apertura
aquaduct
antecesor
antoha
apetit
aqualung
aquarel
arma
asesinato
asunto
aquarium
armamento
asesino
ata
ara
armando
asexual
ataca
Arabe
armband
asexualidad
atacado
Arabia
armbos
asfalt
atacando
Arabier
armisticio
asfalta
atake
aramento
arogancia
asfaltamento
atardi
arando
arogante
asfaltando
ate
ararut
aroma
ashibi
ateismo
Arawak
aromatico
Asia
ateista
arbitrariamente
aros
Asiatico
atencion
arbitrario
arpeggio (mus.)
asiel
atende
arbitro
arsenico
asiento
atendi
arca
arsobispado
asilo
atendiendo
arcaico
arsobispal
asimetria
atenta
arcaismo
arsobispo
asimetricamente
atentado
arcangel
arte
asimetrico
atentamente
archief
artefacto
asimila
atentando
archipielago
arteria
asimilacion
atento
architect
arteriosclerosis
asimilando
aterisa
arco iris
artesanal
asina
aterisahe
ardaplo [aardappel]
artesania
asistencia
aterisando
area
artesano
asisti
Atlantico
aregla
articula
asistiendo
atlas
areglando
articulacion
asma
atleta
areglista
articulando
asmatico
atletico
areglo
articulatorio
asocia
atletismo
arena
articulo
asociacion
atmosfeer
arepenti
artificial
asocial
atmosfera
arepentimento
artificialidad
asociando
atmosferico
aresta
artificialmente
asociativo
atomico
arestando
artileria
asoleho
atonico
aresto
artista
asombra
atoom
Argentina
artisticamente
asombrando
atoombom
Argentinero
artistico
asombro
atraca
Argentino
artritis
asombroso
atracado
argumenta
artrosis
asota
atracando
argumentacion
Aruba
asotando
atraccion
argumentando
Arubano
aspecto
atraco
argumento
arubianismo
asperge
atractivo
aria (mus.)
Arubiano [Rubiano]
aspira
atrae
ariba
as
aspiracion
atrai
aribabao/aribabou
asalta
aspirando
atrapa
aribabou/aribabao
asaltando
aspirin
atrapada
aribariba
asaltante
assistent
atrapando
Aries
asalto
astrologia
atras
aristocracia
asambla
astrologico
atrasa
aristocraticamente
asamblando
astrologo
atrasando
aristocratico
asamblea
astronaut [astronauta]
atraso
aritmetica
asbak
astronauta [astronaut]
atravesa
aritmetico
ascende
astronautica
atrayendo
arkeologia
Ascension
astronave
atribui
arkeologico
asco
astronomia
atributivo
arkeologo
asegurado
astronomico
atributo
arkidiocesis
asenti
astronomo
atribuyendo
arkitecto
asentiendo
asumi
atrobe [trobe]
arkitectonico
asesina
asumiendo
aubade
arkitectura
asesinando
Asuncion
audiencia
audiovisual
autorisa
azeta [zeta]
bailarina
auditivamente
autorisacion
azetamento [zetamento]
baile
auditivo
autorisando
azetando [zetando]
baina
auditorio
autoritario
Azteca
bais
augurk
auxilia
azufro
baiskel
augustus
auxilio
azuleho
bajonet
aula
avalancha
baas
baki
aumenta
avance
baba
bakia
aumentando
avansa
babado
bakiano (s.)
aumentativo
avansando
babamento
bakiyou [bacalou]
aumento
Ave Maria
babando
bal
aunke
avena
babel
bala
aura
avenida
babero
balabala
aurora
aventura
Babilonico
balada
ausencia
aventurero
babuca
balahu
ausente
averahe
babun
balander [balandro]
auspicia
averigua
baby
balandro [balander]
auspiciando
averiguacion
babysit (s.) [babysitter]
balans
auspicio
averiguando
babysit (v.)
balansa
austeridad
aversion
babysitter [babysit]
balansamento
Australia
avestruz
baca
balansando
Australiano
aviacion
bacalou [bakiyou]
balaster [balastro]
Austria
avicultor
bacanal
balastra
Austriaco
avicultura
bacator
balastro [balaster]
autarkia
avion
baccarat
balchi
autarkico
avioneta
bacha
balcon
autenticidad
avisa
bachi
baldadi
autentico
avisando
bacil
bale (s.)
auto
aviso
bacoba
bale (- la pena)
autobiografia
awa
bacteria
balein
autobiografico
awacati
bacteriologia
balente
autobus
awasero
bacteriologico
balentia
autocraat
awe
bacteriologo
balentin
autocracia
awel
badabada
balia [baila]
autocratico
awendia
badbroek
baliabel [bailabel]
autocritica
aw'i florida
badkuip
baliado [bailado]
autoctono
awo [awor]
badminton
baliamento [bailamento]
autodeterminacion
awor [awo]
badpak
baliando [bailando]
autodidact
aworaki
baf
balie
autodidactico
aworey
bagamunderia
baliña
autoestima
aworo [oro]
bagamundo
balki
automat
axioma
bagas
ballet
automaticamente
ay
bagatel
ballpoint
automatico
aya
bagatelisa
balo [balor]
automatisa
ayabanda
bagatelisando
balon
automatisacion
ayabao/ayabou
bagon
balor [balo]
automatisando
ayabou/ayabao
baha
balora
automatismo
ayaca
bahada
baloracion
automobil (adh.)
ayacerca
bahamento
baloramento
automobilista
ayaden
bahando
balorando
autonomamente
ayafo
baho
balota
autonomia
ayariba
bahul
balotacion
autonomo
ayatras
baila [balia]
balotamento
autoped
ayera
bailabel [baliabel]
balotando
autopista
ayo
bailado [baliado]
bals
autopsia
ayudante
bailamento [baliamento]
balsama
autor
ayudo
bailando [baliando]
balsamando
autoridad
azahar
bailarin
balsamo
balua
barbecue
bastro [baster]
beha/bh
baluacion
barberia
bat
beheit
baluado
barbero
bata
behes
baluamento
barbishi
batata
behuco
baluando
barbon
bataya
beige
baluarte
barbulet
batayando
beis
balustrada
barca
batayon
beishi
bambu
barcamento
bate
beit
bambusher
barcando
bateo
beitel
bami
barco
bateri
bek
ban
barera
bateria
beker
banana
baret
bati
bekmento
bancario
barete
batia
bel
bancarota
bari
batiado
bela
banchi
barica [bariga]
batido
belasting
banco
baricada
batiendo
beleg
bancomatico
baricadia
batik
Belga
banda
barido
batimento
Belgica
bandeau
bariendo
batisa
Belgicano
bandera
bariga [barica]
batisamento
bellboy
banderin
barigonchi
batisando
bembe
banderita
barimento
batrey
bena
bandido
bario
batuta
benauwd
banditismo
bariton
bautismo
bencha
bandona
barok
bauxiet
benchamento
bandonamento
barokismo
bay
benchando
bandonando
barometer [barometro]
bay om
bende
bangaña
barometro [barometer]
bay op
bendedo
bankero
baron
bayena
bendedora
banki
baronesa
bayendo
bendemento
bankroet
baronia
baymento
bender [bendro]
bankschroef
bartender
bayonista
bendi
bansa
bas
bazjan
bendibel
banzer
basa
bazooka
bendicion
baña
basando
be (bes)
bendiciona
bañamento
base
beach
bendicionamento
bañando
baseball
beaco
bendicionando
baño
basha
beam
bendiendo
bao/bou
bashaca
beamer
bendita
bapor (barco)
bashamento
beatifica
bendro [bender]
bar
bashando
beatificacion
beneficia
bara
bashi
beatificando
beneficiando
baracuda
basicamente
bebe
beneficiario
baraha
basico
bebedo
beneficio
barahamento
basila
bebemento
beneficioso
barahando
basilamento
bebi (part.)
benefishi
barak
basilando
bebibel
benemuur
baranca
basilica
bebida [bibida]
benesnuk
barata
basilon
bebiendo
benigno
baratisimo
basinia
beca
bens
baratio
basista
becado
benta
barba
basket
becario
bentabal
barbachi
basketball
bedaar
bentaha
barbacoa
basora
bedank
bentahoso
barbaramente
basta
bedey
bentamento
barbaridad
bastante
beer
bentana
barbarismo
baster [bastro]
beerput
bentando
barbaro
baston
begonia
berano
berans
bibo
binida
bisti
berdad
bicarbonato
binidero [venidero]
bistiendo
berdaderamente
bicentenario
biniendo
bistimento
berdadero
bichi
binimento
bisto
berde
bicia
binocular
bit
berdura
bicicleta
binti
bitter [betro]
berea
bicio
binticinco
biyar
berebere
bicolo [bicolor]
binticuater [binticuatro]
biyechi [briyechi]
berehein
bicolor [bicolo]
binticuatro [binticuater]
biyon
bergonsoso
bid
bintidos
blaar
berguensa
bida
bintinuebe
blaas
berom
bider
bintiocho
blabla
bers
bidet
bintiseis
blachi
bes
biehes [biehesa]
bintishete
black (sapato)
beschouder
biehesa [biehes]
bintitres
blackjack
beshi
biehita
bintiun
blacklist
beskem
biehito
biña
blackout
best
bien
biograf
blad
bester [bestro]
bienes
biografia
blade/blet
bestia
bienestar
biografico
blader
bestial
bienhechor
biokimica
blaf
bestialidad
bienta
biokimico
blafmento
bestialmente
bientadera
biologia
blafon
bestraal
bientamento
biologicamente
blafona
bestraling
bientando
biologico
blafonamento
bestro [bester]
biento
biologo
blafonando
bet
Bierna Santo
biopsia
blameer
betmento
bieu
bira
blancha
beton
big wheel
birada
blanchado
betonica
biga
birambi
blanchamento
betra
bigamia
biramento
blanchando
betro [bitter]
bigamista
birando
blanco
beurs
bigonia (herment)
Birgen (rel.)
blancura
beurt
bigoti
biroshi
blankia
beyesa
bij
bis (mus.)
blankiando
beyisima
bijbel [biblia]
bisa
blasfemia
bh/beha
Bijbel [Biblia]
bisando
blauw
biaha
bijles
bisanieta
bledi (bala di -)
biahamento
bijziend
bisanieto
bleek
biahando
bik
bisawela
blekero
biahe
biki
bisawelo
bleki
biahero
bikini
bisemanal
blenchi
biba
bikmento
bisexual
blet/blade
bibamento
bil
bisexualidad
blikia
bibando
bilabial
bishe
blikiando
bibida [bebida]
bilateral
bishita
blind
bibito
bilateralmente
bishitamento
blink
bibitopin
bilingual
bishitando
blitzkrieg
biblia [bijbel]
bilingualismo
bishitante
blo
Biblia [Bijbel]
biloria
bisiesto
blocnote
biblico
bimensual
bisilabico
bloemkool
bibliobus
bimotor
bisindario [vecindario]
blof
bibliografia
bin [bini]
bisiña
blofdo
bibliografico
bina
bison
blofmento
biblioteca [bibliotheek]
binager
bispo
blokeo
bibliotecaria
bingo
bispou
blokfluit
bibliotecario
bini [bin]
bista
bloki
bibliotheek [biblioteca]
binibini
bistek
blokia
blokiamento
bol'i fuego
book (p.e. pasashi)
bowling
blokiando
bolita
boor
box
blond
bolivar
boormashin
boxdo
blondina
bolivariano
boorwater
boxeo
bloos
Bolivia
boots
boycott
blous
Boliviano
bora
boyo
blousa
bolo
boramento
brabo
blousana
bolobonchi
borando
braga
blow (v.)
bolpes
borchi
bragadam
blower
bols
borda
brainstorm
bludeifi [buladeifi]
bolsa
bordaha
brak
blufein
bolshewiki
bordamento
brake
blusa
bolshewismo
bordando
brakhas
bo
bolter
bordo
brancard
boa
boltermento
borg
brandspuit
bobedad
boltia
boroca
brandweer
bobo
boltiamento
borocamento
brandy
boca
boltiando
borocando
brant
bocal
boltro
boroha
brasa
bochincha
boluntad
borohamento
brasamento
bochinchero
boluntariamente
borohando
brasando
bochorna
boluntario
borota
Brasil
bochornando
bom
borotando
Brasileño [Brasilero]
bochorno
bomba
boroto
Brasilero [Brasileño]
bochornoso
bombardeo
borstel
brazi (pisca)
boco
bombardia
borstspeld
brazier
boda
bombardiando
bos
brazil (mata)
bodega
bombe
bosa
Brazil (Aruba)
body
bombena
bosal
break
boei
bombenando
bosamento
breba
boek (adm.)
bombero
bosando
brehochi
boekel
bombio
bosha
brei
boekhandel
bomboshi
boshi
breilat
boet
bon
boso
breimento
boetmento
Bonaire
bosua (mata)
bres
bofi
bonansa/bonanza
boswa
bresmento
bofon
bonanza/bonansa
botanica
breuk
bofta
bonbida
botanico
breve
boftando
bonbini
boter
brevemente
boga
bonchi
boteya
brich (djente)
bogando
bonconco
boteyado
brievenbus
bogel
bond
boteyamento
brigada
bohi
bonda
boteyando
brigadier
bohoti
bondad
botica
bright
boicotia
bondadoso
boticario
brik (boto)
boicotiamento
bonder [bondro]
botikin
bril
boicotiando
bondro [bonder]
botin
brinda
boiler
bonechi
boto
brindando
boket [bouquet]
Boneiro
boton
brindis
boks (v.) (dal den otro)
bonerianismo
botona
bringa
boksmento
Boneriano
botonamento
bringado
bol
bongo
botonando
bringamento
bola
bonito (pisca)
botou
bringamosa
bolbe
bono
botro
bringando
bolbiendo
bonofes
bou/bao
briol
bolero
bons
boulevard
brisa
boletin
bonus
bouquet [boket]
Britania
boli
boog
bouwkeet
Britanico
briya
buelta
bypass
caha
briyando
buena (expr.)
byte
cahera
briyante
buey
caba
cahero
briyechi [biyechi]
buffet
cabada
cahita
briyo
buk
cabalmente
caicay
broadcast [brokest]
buki
cabamento
caida
broche
bul
cabana
caiman
brochure
bula
cabando
cakiña
broeder
bulada
cabaret
cala
broei
buladeifi [bludeifi]
cabaron
Calabas
brokest [broadcast]
bulado
cabay
calacuna
broma
bulamento
cabayero
calafriu
bromado
bulando
cabayete
calala (pisca)
bromamento
bulchi
cabayista
calalu
bromando
Bulgaria
cabayito
calamber
brommer
Bulgaro
cabes
calamidad
brongosa
bulldog
cabesante
calandro
brongosamento
bulldozer
cabesura
calashi
brongosando
bulto
cabey
calba
bronkitis
bululu
cabina
calbas
brons
bumper
cabinet
calco
bros
bungalow
cabisa
calcula
brota
buni (pisca)
cabisha
calculabel
brotando
bunita
cabishando
calculacion
brouw
bunitesa
cabishot (pisca)
calculamento
brouwmento
burache
cabito
calculando
bruela [bruhela]
buracheria
cabo
calculo
brug
burachi
Cabo Verde
cale
bruha
buraco
Cabo Verdiano
caleidoscop
bruhacion
burdugu
cabricuchi (pisca)
caleidoscopico
bruhamento
burgues
cabrito
calendario
bruhando
burguesia
cabuya
calia
bruhela [bruela]
burico
cacalaca
caliber
bruheria
burla
cacha
calibra
bruid
burlamento
cachapa
calibramento
bruidegom
bureaucraat
cachete
calibrando
bruidsjongen
burocracia
cacheton
calichi
bruidsmeisje
burocrata
cachicachi
calidad
bruin
burocratico
cachicambito
caligraf
bruki
burusi
cachicandela
caligrafia
brunch
bus
cachimba
caligrafo
brusca
busca
cachito
caliz
brush
buscado
cacho
calki
brutal
buscamento
cachot
call
brutalidad
buscando
caco
calma
brutalmente
buscuchi
cacumbein
calmando
bruto
buscunu
cada
calmante
bubble gum
busha
cadaver
calmeki
bubi (parha)
bushi
cadechi
calochi
bucea
bushicuri (mata)
cadena
calor
buceado
buskeda
cadenando
caloria
buceamento
busto
cadencia
calumnia
buceando
buta
caduca
calurosamente
buceo
butacon
caducando
caluroso
buchi
butamento
cadushi
calvario
Buda
butando
cafeina
calvinismo
budismo
butishi
cafetaria
calvinista
budista
buya
cafut
cama
camara
candelchi
capricho
carera
camari (mata)
candidata
caprichoso
caret
camber
candidato
Capricornio
careta
cambia
candidatura
capro
caretera
cambiabel
cane
capsula
carga
cambiamento
caneblum
capta
cargabel
cambiando
cangaru
captando
cargado
cambio
cangreu
captura
cargamento
cambou
cangrina
capturando
cargando
cambrada
canibal
capuchin (fli)
Caribe
camel
canibalismo
capuchino (ordo rel.)
Caribense [Caribeño]
caminata
canica
Caquetio
Caribeño [Caribense]
caminda
canoa
cara
caricari
camisa
cansa
carabina
caricatura
campa
cansancio
carabinero
caricaturista
campado
cansando
Caracas
caricia
campamento
canta
caracho
cariciando
campana
Cantabrico
caracter
caridad
campando
cantado
caracterisa
caries
campaña
cantamento
caracterisabel
carillon
campañado
cantando
caracterisacion
cariño
campañando
cantante
caracterisando
cariñosamente
campeon
cantica
caracteristica
cariñoso
campeonato
cantidad
caracteristico
carioca
campo
cantin
caracterologia
carisimo
campus
cantina
caracterologico
carisma
camufla
cantinero
caramba
carismatico
camuflahe
canto
carambola
cariso
camuflando
caña
caramel
caritativo
can (carta)
cañando
caraña (pisca)
carite (pisca)
cana
caos
carañito (pisca)
carnal
Canada
caotico
Caraqueño
carnaval
Canades
capa
caravana
carnavalesco
canal
capabel
carawara [cawara]
carnavalista
canalisa
capacidad
caray
carne
canalisabel
capacita
carbachi
carni
canalisacion
capacitacion
carbon
carniceria
canalisando
capacitando
carbonico
carnicero
canamento
capaduro
carbonisa
carnisa
canando
capamento
carbonisacion
carnivoor [carnivoro]
canari
capando
carbonisando
carnivoro [carnivoor]
canaster [canastro]
capaz
carbonstein
caro
canastro [canaster]
capia
carburator
carosa
canawa
capiamento
carcas
carot
cancela
capiando
carchi
carpachi
cancelacion
capital
carcinoma
carpata
cancelamento
capitalismo
cardinal (adh.)
carpitan (pisca) [capitan]
cancelando
capitalista
cardiograf
carpinte
cancer
capitan
cardiografia
carpinteria
Cancer
capitan (pisca) [carpitan]
cardiogram
carrousel
cancha
capitula
cardiologia
carson [cashon]
canchi
capitulacion
cardiologo [cardioloog]
carsonsio [cashonsio]
cancion
capitulando
cardioloog [cardiologo]
carta
canciyer
capitulo
carece
cartel
candal
capoti
careciendo
cartera
candel
capotou (tempo cera)
careda
cartograf
candela
cappuccino (koffie)
carencia
cartografia
candelaria
capricha
carent
cartografico
cartolina
catara
celebrando
cero (numeral)
carton
catarata
celebro [cerebro]
certamen
cartoteca
catashi (mata)
celestial
certidumbre
caruña
catastrofe
celibatario
certifica
cas
catastrofico
celibato
certificacion
casa
catch
cello
certificado
casa mortuoria
catcher
celluloid
certificando
casacion
catedra
cellulose
cesantia
casamento
catedral
celofan
cesarea
casando
categoria
Celsius
chabalito
casca
categoricamente
celula
chachacha
cascabel
categorico
celular
chalaca
cascamento
categorisa
cement
chamba (pisca)
cascando
categorisacion
cen
chambon
casconchi
categorisando
cena
chambonada
casero
catheter
cenando
champagne
cash
catibo
cende
champignon
cashaca
catisashi
cendedo
chanchan
cashi
catochero
cendemento
changa
cashipete [cashupete]
catochi
cendepaga
changando
casho
catolicismo
cendi
chansa
cashon [carson]
catolico
cendiendo
chansado
cashonsio [carsonsio]
catro
censo
chansamento
cashupete [cashipete]
catuchi
censura
chantahe
casi
catumbom (mata)
censuramento
chantahia
casino
catuna
censurando
chantahiando
casita
causa
centenar
chapaleta
casnechi (lenso)
causando
centenares
chapara
caso
causante
center
chaperonne
cassette
caushati (mata)
centiare
chapi
castaña
cautela
centigram
chapo
Castellano
cautelosamente
centiliter [centilitro]
charada
castiga
cauteloso
centilitro [centiliter]
charge
castigabel
caviar
centimeter [centimetro]
charger
castigamento
cavidad
centimetro [centimeter]
charla
castigando
cawara [carawara]
central
charlatan
castigo
caweta
centralisa
charter
Castilla
caweteria
centralisacion
chasco
castol
cay
centralisando
chasis
castrismo
caya
centralismo
chaskero
casual
cayehera [cayera]
centralista
chauffeur
casualidad
cayehero [cayero]
centro
chauvinismo
casualmente
cayena
cera
chauvinista
casuela
cayendo
ceramento
chayote
cataboli (pisca)
cayente
ceramica
che
cataclismo
cayera [cayehera]
ceramico
cheap
catacumba
cayero [cayehero]
ceramista
checheibi (pisca)
catalisa
caymento
cerando
check
catalisacion
cayo
cerebro [celebro]
check in
catalisado
cayon
cerbes
check out
catalisando
cayou
cerbeseria
checkdo
catalog
CD
cerca
checkmento
catalogisa
cedille
cercando
checkup
catalogisacion
cedula
cercania
Checo
catalogisando
cel
cercano
chef-kok
catamaran
celebra
ceremonia
chekeo
catapila
celebracion
ceremonial
Chekia
cataplasma
celebral
ceremonioso
chemene
chemotherapie
chol
cinema
clarificacion
[kimoterapia]
choller
cinemascop
clarificando
chens
chonchorogay
cinematograf
clarinet
cheque (banco)
chubato
[cinematografo]
claro
chercha [cherche]
chucho
cinematografo
clase
cherchado
chuchubi
[cinematograf]
clash
cherchamento
chuculati
cinematografia
clasicismo
[cherchemento]
chulastico
cinematografico
clasicista
cherche [chercha]
chulo
cinico
clasico
cherchemento
chumbo
cinismo
clasifica
[cherchamento]
chup/tube
cinta
clasificabel
cherry
chupa
cintura
clasificacion
Chi (apel.)
chupabebe
circo
clasificado
chi cu cha
chupachupa
circuito
clasificando
chibatia
chupado
circula
claustrofobia
chibatiamento
chupamento
circulacion
clausula
chibatiando
chupando
circulando
clausura
chibo
chupon
circular
clausurando
chic
cibernetica
circulo
clave
chica
cibernetico
circumflex
clavel
chicamento
cicatriz
circuncida
clear
chicando
ciclico
circuncision
clechi
chicharon
ciclismo
circunferencia
cleconchi
chichi
ciclista
circunstancia
clerical
chick
ciclo
circunstancial
clero
chickenfarm
ciclon
cirkel
cliché
chicoti
ciega
cirugia
cliente
chief umpire
ciegamente
ciruhano
clientela
chikitin
ciego
cis (mus.)
clima
chikito
cieguedad
cita
climatologia
Chile
cielo/shelo
citaat
climatologico
Chileno
cien/shen
citacion
climatologo
chilin
ciencia
citando
climax
chimpanse
cientificamente
ciudad
clinchi
China
cientifico
Ciudad Vaticano
clinchimento
chincha
cierto
ciudadano
clinica
chinchin
cifra
civico
clinicamente
chinchirinchi
cilinder [cilindro]
civil
clinico
Chines
cilindrico
civilisa
cloks
chino
cilindro [cilinder]
civilisacion
clompi
chip
cinco
civilisando
clonchi
chiripa
cinc’or
civismo
clone
chirurg
cincuenta
cla
cloro
chispa
cincuenticinco
claba
clorox
chiste
cincuenticuater
clabamento
closhi
chistoso
[cincuenticuatro]
clabando
club
chloor
cincuenticuatro
clabio
clubhuis
chlorofyl
[cincuenticuater]
clabo
cluster
choca
cincuentidos
clafachi
clutch
chocamata
cincuentinuebe
clafatia
coach
chocamento
cincuentiocho
clafatiando
coalicion
chocando
cincuentiseis
clandestinamente
coba
chocho
cincuentishete
clandestino
cobalt
chocomel
cincuentitres
claramente
cobamento
chogogo
cincuentiun
claria
cobando
chok
cincuria (placa)
clariando
cobarda
choke
cine
claridad
cobarde
chokmento
cineasta
clarifica
cobardemente
cobardia
cohon
colonisacion
comia
cobardiando
coil
colonisado
comibel
cobeit
coincidencia
colonisando
comico
cobertura
coincidente
colonista
comiendo
cobra
coincidi
color [colo]
comienso
cobrabel
coincidiendo
colorido
comino
cobrado
coketa
columna
comiquita
cobramento
coketeria
columnista
comis
cobrando
coketia
coma
comisariado
cobransa/cobranza
coketiando
comader
comisario
cobranza/cobransa
coki
comanda
comision
coca
col (di paña)
comandando
comite
cocada
cola
comandante
commies (rango)
cocaina
colabora
comando
como
cocal
colaboracion
comay
comodamente
cochi
colaborado
combati
comodidad
cochino
colaborando
combatiendo
comodo
cochocho
colado
combatimento
comokiera
cocktail
colamento
combersa
comosifuera
coco
colando
combersacion
compa
cococha
colebra
combersando
compacto
cocochando
coleccion
combida
compader
cocodek
colecciona
combidamento
compania
cocolishi
coleccionamento
combidando
compaña
cocolode (mata)
coleccionando
combina
compañamento
cocorobana (mata)
coleccionista
combinacion
compañando
cocoti
colecta
combinando
compañe
cocoyoco
colectamento
combito
compañera
code
colectando
combles
compañero
codicia [cudisha]
colectivo
combo
compaño
codicioso [cudicioso]
colega
combustibel
compara
codifica
colegial
comchi [conchi]
comparabel
codificacion
colegio
come
comparacion
codificando
colera
comedia
comparando
codigo
colesterol
comediante
comparativamente
cododo
colga
comedo
comparativo
coeduca
colgamento
comedo (luga) [comedor] comparti coeducacion
colgando
comedor (luga) [comedo] comparticion coeducado
collage
comehein
compartiendo
coeducando
collapse
comemento
compartimento
coecoei
collect
comenta
compas
coexistencia
collectant
comentando
compasion
coexistente
colloquium
comentario
compatibel
coexisti
colmo
comentarista
compatibilidad
coexistiendo
colo [color]
comer
compatriota
cofinancia
coloca
comercial
compay
cofinanciado
colocacion
comercialisa
compensa
cofinanciamento
colocamento
comercialisacion
compensacion
cofinanciando
colocando
comercialisando
compensando
cofir
colocolo
comercialmente
comper
coge
colofon
comerciante
competencia
cogiendo
Colombia
comercio
competente
cognac
Colombiano
comestibel
competi
cognitivo
colonia
cometa
competido
coherencia
colonial
comete
competiendo
coherente
colonialismo
cometi
competitivo
cohesion
colonialista
cometiendo
compila
coho
colonisa
comi
compilacion
compilado
compronde [comprende]
concomber
confiando
compilando
comprondemento
concorda
confiansa/confianza
compinchi
[comprendemento]
concordancia
confianza/confiansa
complace
comprondiendo
concordando
confidencia
complaci
[comprendiendo]
concret
confidencial
complaciendo
computarisa [computerisa] concretamente confirma
complaciente
computarisacion
concretisa
confirmacion
complehidad
[computerisacion]
concretisacion
confirmando
compleho
computarisando
concretisando
confiro
complementa
[computerisando]
concreto
confisca
complementacion
computer
concurencia
confiscacion
complementando
computerisa [computarisa] concurso confiscamento
complemento
computerisacion
conde
confiscando
completa
[computarisacion]
condecora
conflicto
completacion
computerisando
condecoracion
conflochi
completamente
[computarisando]
condecorando
confo
completando
comun
condena
conforma
completo
comunica
condenabel
conformando
complica
comunicacion
condenacion
conforme
complicacion
comunicado
condenando
conformidad
complicando
comunicando
condensa
conformismo
complice
comunicativo
condensacion
conformista
complicidad
comunidad
condensando
confortabel
confortablemente
compliment
comunion
condenser
confronta
compone
comunismo
condesa
confrontacion
componente
comunista
condicion
confrontando
componi
comunitario
condiciona
confundi
componiendo
con
condicional
confundiendo
comporta
con tal cu
condicionalmente
confusion
comportacion
concebi
condicionando
confuso
comportando
concede
condimento
conga
composicion
concedi
conditioner
congla
composita
concediendo
condoleer
congreashi
compositando
concentra
condolencia
congrega
compositor
concentracion
condom [condon]
congregacion
compra
concentrando
condominio
congrenis
compras (haci -)
concept
condon [condom]
congresista
comprende [compronde]
concepto
conduci
congreso
comprendemento
concerni
conduciendo
conhuga
[comprondemento]
concerniendo
conducta
conhugacion
comprendibel
concerniente
conductor
conhugando
comprendiendo
conces
cone
conhuncion
[comprondiendo]
concesion
conecta
conhuntamente
comprension
conchale
conectando
conhunto
comprensivo
conchi [comchi]
conenchi
conico
comprimi
conciërge
coneu
conkista
comprimiendo
concierto
conexion
conkistado
comproba
concilia
coney island
conkistamento
comprobabel
conciliacion
conferencia
conkistando
comprobacion
conciliando
confesa
conmemora
comprobando
concilio
confesando
conmemoracion
comprobante
concipia
confesion
conmemorando
compromete
concipiando
confesional
conmemorativo
comprometi
conciudadano
confesionario
conmocion
comprometida
conclo [konkel]
confesor
conmove
comprometido
conclui
confia
conmovedor
comprometiendo
conclusion
confiabel
conmovi
compromiso
concluyendo
confiabilidad
conmoviendo
consistiendo
contaminando
contrastando
conoce
consola
contando
contraste [contrast]
conocedo
consolacion
contempla
contrata
conocemento
consolando
contemplacion
contratando
conoci
consolida
contemplando
contratiempo
conociendo
consolidacion
contemplativo
contratista
conofes
consolidando
contemporaneo
contrayendo
conoflok
consonante
contene
contribucion
conopa
conspira
contenido
contribui
conopamento
conspiracion
conteniendo
contribuyendo
conopando
conspirado
contento
contribuyente
conopi
conspirando
conteo
contricion
conoscat [knoopsgat]
constante
contest
contrincante
conoshi
constantemente
contesta
control
conrector
constata
contestabel
controla
consagra
constatando
contestacion
controlabel
consagracion
constelacion
contestando
controlado
consagramento
consterna
contexto
controlamento
consagrando
consternacion
contextualisa
controlando
consciencia
constitucion
contextualisacion
controversia
consciente
constitucional
contextualisando
controversial
conscientemente
constitucionalmente
continental
convence
conscientisa
constitui
continente
convenci
conscientisacion
constituyendo
contingente
convenciendo
conscientisando
constituyente
continua
convencion
consecuencia
construccion
continuacion
convencional
consecuente
constructivo
continuamente
conveni
consecuentemente
constructor
continuando
convenio
consecutivamente
construi
continuidad
convento
consecutivo
construyendo
continuo
convergencia
conseha
consuelo
contra
convergente
consehabel
consul
contraataca
conversion
consehando
consulado
contraatacando
converti
consehera
consular
contraatake
convertiendo
consehero
consulta
contrabaho
convertimento
conseho
consultando
contrabanda
conviccion
consenshi
consultativo
contrabandista
convoca
consenso
consultorio
contrabasista
convocacion
consenti
consumi
contraccion
convocando
consentiendo
consumido [consumidor]
contract [contracto]
convocatorio
consentimento
consumidor [consumido]
contracto [contract]
coopera
conserbe
consumiendo
contradeci
cooperacion
conserva
consumo
contradiccion
cooperado
conservacion
conta
contradiciendo
cooperando
conservado [conservador] contabel contradictorio
cooperativa
conservador [conservado] contact contrae
cooperativismo
conservando
contactlens
contrai
cooperativo
conservatismo
contacto
contrapartida
coordina
conservativo
contado
contraproposicion
coordinacion
conservatorio
contagia
contraresta
coordinado [coordinador]
considera
contagiando
contrarestando
coordinador [coordinado]
considerabel
contagiosidad
contrarevolucion
coordinando
considerablemente
contagioso
contrarevolucionario
copi
consideracion
container
contrariamente
copia (s.) [kopie]
considerando
contamento
contrario
copia (v.)
consistencia
contamina
contraspionahe
copiado
consistente
contaminacion
contrast [contraste]
copiamento
consisti
contaminado
contrasta
copiando
copiloto
coronacion
couchi boulo
criando
copro [koper]
coronamento
couplet
criansa/crianza
coptrek
coronando
coupon
crianza/criansa
copula
coronario
couveuse
criatura
copulacion
coronel
coverall
cricket
copulando
coroshi
cowboy
criki
copy
corosion
coy
crimen
cora
coroto
coyar
criminal
coral
corporacion
coymento
criminalidad
coran
corporal (adh.)
coyuntura
criminologia
Coran
corsage
crack (droga)
criminologico
corant
Corsou
cralchi
criminologo
corchon
corta
cram
crioyo
corcobia
cortalata
cranchi
crisis
corcor [corocoro]
cortamento
crank
cristal
corda
cortando
crankshaft
cristalino
cordando
corte
crea
cristalisa
cordial
cortes
creacion
cristalisabel
cordialidad
cortesia
creado [creador]
cristalisacion
cordialmente
cortico
creador [creado]
cristalisando
cordon
cortina
Creador (rel.)
cristian
core
corto
creamento
cristianidad
coreccion
corumpi
creando
cristianisa
corectamente
corumpiendo
creatividad
cristianisacion
corecto
corupcion
creativo
cristianisando
corector
coruptivo
crece
cristianismo
coredo
corupto
crecemento
Cristo
coregi [corigi]
cos
crèche
criterio
critica
coregibel [corigibel]
cose
creciendo
criticamente
coregiendo [corigiendo]
cosecha
creciente
criticamento
coregimento [corigimento] cosechando credencial
criticando
corela
cosedo
credibilidad
critico
corelacion
cosemento
credit
crocodil
coremento
coshet [korset]
credit card
cronica
coreograf [coreografo]
cosi
credito
cronico
coreografia
cosiendo
credo
cronista
coreografo [coreograf]
cosmetica
creencia
cronologicamente
coresponde
cosmetico
creibel
cronologico
corespondencia
cosmico
creinagel
crou
corespondi
cosmograf
crelchi
crucero
corespondiendo
cosmologia
crem [krimp]
crucial
corespondiente
cosmologico
crema
crucifica
coresponsabel
cosmonaut [cosmonauta]
cremacion
crucificacion
coresponsal
cosmonauta [cosmonaut]
cremando
crucificado
cori
cosmopolita
crematorio
crucificando
coriendo
cosmos
crème
crucifixion
coriente
costa
cremencha
crucigrama
crudo
corigi [coregi]
Costa Rica
cremenchando
cruel
corigibel [coregibel]
costando
crenchi
crueldad
corigiendo [coregiendo]
Costaricense
creolin
cruelmente
corigimento [coregiendo] Costariqueño crepchi
crusa
corki
costo
crêpepapier
crusada
cornea
costoso
crescent wrench
crusamento
corner
costurera
creyendo
crusando
cornflakes
cota
creyente
cruz
coro
coti coti
cria
cu
corocoro [corcor]
couchi
criado
cua
corona
criamento
cuaba
cuadra
cuchara
cuminda (v.) [cuinda]
cursista
cuadrando
cucharon
cumindamento
cursiva
cuadrangular
cuchi cuchi (adv.)
[cuindamento]
cursivando
cuadrangulo
cuchicuchi (v.)
cumindando
cursivo
cuadratura
cuchiu
cuminsa [cunsa]
curso
cuadria
cucu
cuminsamento
curti
cuadro
cucuduti (pisca)
curtido
cuadrupedo
[cunsamento]
cucuisa
curtiendo
cuaha
cuminsando [cunsando]
cuahando
cudi
cumpleañera
curtimento
cual
cudicioso [codicioso]
cumpleañero
curu
cualidad
cudisha [codicia]
cumpleaño [cumpleaños]
curva
cualifica
cudishi
cumpleaños [cumpleaño]
cus
cualificacion
cueba
cumpli
cushi
cualificando
cuenta
cumplido
cushiendo
cualitativamente
cuerde
cumpliendo
cushina (s.)
cualitativo
cuero
cumplimento
cushina (v.) [cushna]
cualke [cualkier]
cuerpo
cumpra
cushinamento
cualkier [cualke]
cuestion [kestion]
cumprado
[cushnamento]
cualkiera
cuestiona
cumpramento
cushinando [cushnando]
cuando (expr.)
cuestionabel
cumprando
cushna [cushina]
cuantifica
cuestionamento
cuna
cushnamento
cuantificacion
cuestionando
cunsa [cuminsa]
[cushinamento]
cuantificando
cuestionario
cunsada
cushnando [cushinando]
cuantitativamente
cueyo
cunsamento
cusinchi
cuantitativo
cuida
[cuminsamento]
custia
cuanto
cuidado
cunsando [cuminsando]
custuma [custumbra]
cuant'or
cuidadosamente
cunsumi
custumando [custumbrando]
cuarenta
cuidadoso
cunsumiendo
custumber
cuarentena
cuidamento
cunsumimento
custumbra [custuma]
cuarenticinco
cuidando
cunucu
custumbrando [custumando]
cuarenticuater
cuidao/cuidou
cunukero
cute
[cuarenticuatro]
cuido
cuña
cutis
cuarenticuatro
cuidou/cuidao
cup [cups]
cuy
[cuarenticuater]
cuinda [cuminda]
cupo
dabaruida
cuarentidos
cuindamento
cups [cup]
dabizjan
cuarentinuebe
[cumindamento]
cura
dadel
cuarentiocho
cuki
curabel
dader
cuarentiseis
culmina
curacion
dado
cuarentishete
culminacion
Curaçao
dagvaard
cuarentitres
culminando
curahou
dak
cuarentiun
culminante
curamento
dal
cuaresma
culpa
curandera
dalacochi
cuart
culpabel
curandero
dalbay
cuarta
culpabilidad
curando
dalia
cuarto
culpando
curasha
dalmento
cuasha
cultiva
curashando
dam
cuashamento
cultivacion
curashi
dama
cuashi
cultivando
Curasoleño
damita
cuater [cuatro]
cultivo
curason
damp
cuat’or
culto
curatela
dams
cuatro [cuater]
cultura
curativo
dande
Cuba
cultural
curicular
Danes
Cubano
culturalmente
curiculo
dank
cubico
cum laude
curiosidad
danki
cubri
cumbini
curioso
danza (ritmo)
cubriendo
cumbiniendo
curpa
daña
cubrimento
cumbre
curriculum vitae
dañamento
cuminda (s.)
dañando
dañino
decepcionante
definibel
delincuente
daño
decibel
definicion
delinea
dara
decigram
definiendo
delirio
dashboard
deciliter [decilitro]
definitivamente
delito
dashi
decilitro [deciliter]
definitivo
demagogia
data
decimal
deforma
demagogico
database
decimeter [decimetro]
deformacion
demagogo
date
decimetro [decimeter]
deformando
demanda
dativo
decimo (1/10)
defrauda
demandando
dato
decision
defraudacion
demandante
de (expr.)
decisivo
defraudamento
demas
deal
declama
defrost [desfrost]
demascara
dealer
declamacion
deftig [defto]
demasiado
debate
declamado
defto [deftig]
demencia
debati
declamando
defunto [difunto]
demente
debatiendo
declara
degenera
demisionario
debe
declaracion
degeneracion
democracia
debedo [debedor]
declarando
degenerando
democratico
debedor [debedo]
declem
degrada
democratisa
deber
declina
degradacion
democratisacion
debi
declinacion
degradando
democratisando
debidamente
declo [dekel, deken]
deha
demografia
debido
decolonisa
dehado
demograficamente
debiendo
decolonisacion
dehel
demografico
debil
decolonisando
deheluwe
demoño
debilidad
decor
deidad
demoralisa
debilita
decora
deismo
demoralisacion
debilitacion
decoracion
dek
demoralisando
debilitando
decorado
dekel [declo, deken]
demostra
debolbe
decoramento
deken [declo, dekel]
demostracion
debolbi
decorando
dekmento
demostrando
debolbiendo
decorativo
deks
demostrante
debor
decreciente
deksmento
demostrativo
debut
decreta
delanta
demotiva
debuta
decretando
delantero
demotivacion
debutando
decreto
delaster [delastro]
demotivando
debutante
dede
delastro [delaster]
demotivante
decaan [decano]
dedica
delco
dempel
decada
dedicacion
delega
dempelmento
decadencia
dedicando
delegacion
den
decadente
dedonder
delegado
dengue
decagram
deduccion
delegando
denigrante
decai
deduci
deleita
denomina
decaliter [decalitro]
deducibel
deleitando
denominacion
decalitro [decaliter]
deduciendo
delfin [dolfijn]
denominado
decameter [decametro]
default
delibera
denominando
decametro [decameter]
defecto
deliberacion
densidad
decano [decaan]
defende
deliberadamente
dental
decayendo
defendi
deliberando
denter di [dentro di]
december
defendibel
delicadesa/delicadeza
dentista
decena
defendiendo
delicadeza/delicadesa
dentro di [denter di]
decenas
defensa
delicado
denuncia
decencia
defensivo
delicatesse
denunciando
decente
defensor
delicia
denunciante
decentemente
deficiencia
delicioso
deodorant [desodorante]
decepcion
deficiente
delimita
departamento
decepciona
deficit
delimitacion
depchi
decepcionando
defini
delincuencia
depende
dependencia
desafortuna
desciframento
desempata
dependiendo
desafortunadamente
descifrando
desempate
dependiente
desagradabel
desconecta
desemplea
depila
desahoga
desconectando
desempleado
depilacion
desahogando
desconexion
desempleo
depilando
desampara
desconfia
desenlace
deplora
desanima
desconfiando
desenmascara
deplorabel
desanimacion
desconfiansa/desconfianza desenmascarando deplorando
desanimando
desconfianza/desconfiansa deseo
depolitisa
desaparicion
desconoci
deserta
depolitisando
desapercibi
desconseha
desertacion
depone
desaproba
desconsehando
desertando
deponi
desaprobacion
desconsola
desertor
deponiendo
desaprobando
desconta
desespera
deporta
desapropia
descontabel
desesperacion
deportacion
desapunta
descontamento
desesperadamente
deportando
desapunto
descontando
desfaborabel
deporte
desarma
descontinuidad
desfaborece
deportista
desarmabel
descontrola
desfaboreciendo
deportivo
desarmamento
describi
desfigura
deposita
desarmando
describiendo
desfiguracion
depositamento
desaroya
descripcion
desfigurando
depositando
desaroyamento
descriptivo
desfila
deposito
desaroyando
descualifica
desfilando
depresion
desaroyo
descualificacion
desfile
depresividad
desaster [desastro]
descualificando
desformal
depresivo
desastro [desaster]
descubri
desfrost [defrost]
deprimi
desastroso
descubrido
desgaba
deprimiendo
desayuna
descubriendo
desgabando
dera
desayunando
descubrimento
desgana
derame
desayuno
descuento
desgracia
deramento
desbalansa
descuida
desgraciadamente
derando
desbalansando
descuidando
desgraciado
derechista
desbalora [desbalorisa]
descuidao/descuidou
desgraciando
derecho
desbalorisa [desbalora]
descuido
deshaci
deregula
desbalorisacion
descuidou/descuidao
deshaciendo
deregulacion
desbalorisando
descurasha
deshonestidad
deregulando
desbarata
descurashando
deshonesto
deriva
desbaratando
descustuma [descustumbra] desierto derivabel
desbentaha
descustumando
desigual
derivacion
desbentahoso
[descustumbrando]
desiguala
derivando
descabeya
descustumbra [descustuma] desigualdad dermatologia
descansa
descustumbrando
desilusion
dermatologico
descansando
[descustumando]
desilusiona
dermatologo
descanso
desde
desilusionando
dermatosis
descarga
desea
desinfeccion
deroga
descargamento
deseabel
desinfecta
derogacion
descargando
deseando
desinfectando
deros
descarta
desekilibra
desinfectante
derota
descartando
desekilibrando
desintegra
derotando
descende
desekilibrio
desintegracion
des (mus.)
descendencia
desembarca
desintegrando
desacredita
descendiendo
desembarcacion
desinteres
desacreditando
descendiente
desembarcando
desinteresa
desacuerdo
descentralisa
desemboca
desinteresadamente
desafia
descentralisacion
desembocando
desmantela
desafiando
descentralisando
desempaketa
desmantelacion
desafio
descifra
desempaketando
desmantelando
destabilisando
determinante
diapositivo
desmaya
destaca
detesta
diaranson
desmayo
destacando
detestabel
diarea
desmenti
destaho
detestando
diariamente
desmintiendo
destera
deurwaarder
diario
desmobilisa
desterado
devalua
diasabra
desmobilisacion
desterando
devaluacion
diberti
desmobilisando
destiero
devaluando
diberticion
desobedece
destila
devela [desvela]
dibertido
desobedecido
destilacion
develacion [desvelacion]
dibertiendo
desobedeciendo
destilado
develamento
dibuho
desobediencia
destilando
[desvelamento]
diccionario
desobediente
destina
develando [desvelando]
dicha
desodorante [deodorant]
destinacion
devocion
dicho
desola
destinatario
devoto
dichoso
desolacion
destino
dewater
dicidi
desorden
destrosa
dewer
dicidido
desordena
destrosando
di
dicidiendo
desordenando
destruccion
dia
dicon
desordo
destructibel
diabaas
dicta
desorganisa
destructivo
diabel [diablo]
dictado [dictador]
desorganisacion
destructor
diabetes
dictador [dictado]
desorienta
destrui
diabetico
dictadura
desorientacion
destruibel
diabierna
dictamento
despacha
destruyendo
diablito
dictando
despachamento
desunion
diablo [diabel]
dictatorial
despachando
desvela [devela]
diablura
dictee
despectivo
desvelacion [develacion]
diabolico
didactica
despedi
desvelamento
diaconado
didacticamente
despedida
[develamento]
diacono
didactico
despensa
desvelando [develando]
diacritico
dieet [dieta]
desperdicio
desvia
diacronia
dierentuin
despidiendo
desviacion
diacronico
dies
despista
desviando
diadomingo
diescinco
despistamento
detal (por mayor y -)
diafragma
diescuater [diescuatro]
despistando
detaya
diagnose [diagnosis]
diescuatro [diescuater]
desplega
detayadamente
diagnosis [diagnose]
diesdos
desplegando
detaye
diagnostica
diesel
despobla
detayista
diagonal
diesnuebe
despoblando
deteccion
diagram
diesocho
despota
detecta
diahuebs
diesseis
despotico
detectamento
dialectico
diesshete
despotismo
detectando
dialecto
diestres
desprecia
detective
dialectologia
diesun
despreciabel
detector
dialisa
dieta [dieet]
despreciablemente
detencion
dialisado
dietista
despreciando
detene
dialisando
difama
desprecio
deteni
dialisis [dialyse]
difamacion
despropia
detenido
dialitico
difamado
despropiacion
deteniendo
dialyse [dialisis]
difamando
despropiando
detergente
dialoga
difamatorio
desproporcion
deteriora
dialogando
diferencia
desproporcional
deterioracion
dialogo
diferenciacion
desproporcionalmente
deteriorando
dialuna
diferenciando
despues
determina
diamanta
diferente
dessert
determinabel
diamars
dificil
destabilisa
determinacion
diameter [diametro]
dificilmente
destabilisacion
determinando
diametro [diameter]
dificulta
dificultad
directorado
disolucion
divorcio
dificultando
dirigencia
disolve
divulga
difteria
dirigent
disolvi
divulgacion
difunto [defunto]
dirigente
disolviendo
divulgando
digeri
dirigi
disparate
djaca
digeriendo
dirigibel
disparce
djadja
digestion
dirigiendo
disparciendo
djadjamento
digestivo
diripiente
dispensa
djadjando
digital
dirs (herment)
dispensabel
djampou
digitalisa
dirti
dispensacion
djap [job]
digitalisacion
dirtiendo
dispensando
dje
digitalisando
dirtimento
dispidi [drispidi]
djeguedjegue
dignamente
dis (mus.)
